trade_exp/src/Documents/АрендаНоменклатурыВозврат/АрендаНоменклатурыВозврат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b577dbdc-2a6b-4b2d-b6cf-0a93b48f1df2">
  <name>АрендаНоменклатурыВозврат</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="e3901c84-75de-46a1-863d-59aedfc4f14a">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37669b80-5f0d-4859-8cf6-ac1dd38b413d">
    <name>ВернутьКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0dcd20e0-3e3e-4b81-98d9-e069a9ecb9a7">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="371cc52a-75a3-45eb-8dc0-d92862f3bc67">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="70f4af0e-c196-4068-bc6a-3807dbb3f1df">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d6b7634b-4465-4ade-ba0f-a4c57d7d6cc5">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="293c0735-2c1e-4d96-9750-c9019ff8fe34">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="058cddf0-872e-43cc-8378-80345c5e7272">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="78db0f2d-66e6-4192-abc2-83fc34f2ec80">
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4d451234-16b9-4e75-8444-3a41ee8d691f">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f4a101a1-ccb9-46c9-af17-3fbdc9dd398b">
    <name>ДатаВозвратаФакт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cb6b3e32-e5e7-44cf-9907-e01ef8b3225b">
    <name>СуммаУслуг</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="85fda3ba-c7ae-4f55-a1c7-da66cb7bb5cd">
    <name>СуммаЗалога</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f79debbe-ceed-4aac-bc88-8cf8df82df76">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b50aa1f2-b6d6-4558-8409-2e20f83b1338">
    <name>ДатаСдачиВАренду</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="a2379c0c-4eb1-4eba-a219-f9fc5791c645">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="1f071d60-9c4d-4980-8801-caab222b97c9">
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75be784e-694a-43ca-adb4-1bbe575e97b8">
      <name>УслугаАренды</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="201e8bc2-0588-4a5f-8ec6-f4544ff8bc28">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7cd4c673-05a1-4f63-ad60-280c2798e5a7">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5f60a5e6-bee1-4cc6-b10e-cd5e4e47eaed">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c25caf32-20e2-40ae-a10e-2a35939bd3a2">
      <name>Период</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c4657879-4faa-4ac3-99a8-43288988dfdb">
      <name>КоличествоУслуги</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5d48325f-35a7-4124-920e-97d78344b8fc">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b1921686-2250-4b72-8442-dbd4021e6cf3">
      <name>ЦенаУслуги</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2c36ffd4-5c5f-4003-a280-3a0703441e53">
      <name>СуммаСНДСУслуги</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3bf3c2e8-cc67-4c9a-82a1-85a627b70355">
      <name>СуммаЗалога</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6b428f1b-e0af-4cc5-90ce-7d26bc5a7ada">
      <name>ДатаСдачиВАренду</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2e2a3cf6-adec-4c52-a3de-1c02f1ff140a">
      <name>ДатаВозврата</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Enums/СтатусыРеализацийТоваровУслуг/СтатусыРеализацийТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыРеализацийТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Отгружено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="56f07675-a2f8-4ddb-9844-2f6199f18f86">
    <name>КПредоплате</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СпособыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ДоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаПоАдресу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КПолучателюОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Самовывоз</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтОтправителяОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НашимиСиламиСАдресаОтправителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоПунктаПередачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПоставщикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ВариантыОформленияПродажи/ВариантыОформленияПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыОформленияПродажи</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>АктНаПередачуПрав</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияТоваровУслуг</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктВыполненныхРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыЧековККМ/СтатусыЧековККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыЧековККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Пробит</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="994ecf6c-34a9-4274-952e-8a44959ddd3d">
    <name>КОплате</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="238e807a-b6d8-401c-b115-0e10b84a16c1">
    <name>ОтложенБезРезервирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b8d448b2-f4c4-4fef-bd83-69bf834a37d5">
    <name>ОтложенСРезервированием</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/КассыККМ/КассыККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КассыККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Documents/АрендаНоменклатурыВозврат/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СозданиеНаОсновании
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.РасходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.ПеремещениеТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.ЧекККМ.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);    
	
КонецПроцедуры       

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	ИмяДокумента = "АрендаНоменклатурыВозврат";
	Если ПравоДоступа("Добавление", Метаданные.Документы[ИмяДокумента]) Тогда
		КомандаСоздатьНаОсновании = КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы[ИмяДокумента].ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы[ИмяДокумента]);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено; 
	
КонецФункции

Процедура ЗаполнитьДокументРеализацияПоОснованию(Объект, ДанныеЗаполнения) Экспорт
	
	ДокОснование = ДанныеЗаполнения;
	ДанныеЗаполнения = Новый Структура;
	
	ЗаполнитьЗначенияСвойств(Объект, ДокОснование, , "Номер, Дата, Автор");	
	Объект.Согласован= Истина;
	Объект.Дата= ТекущаяДата();
	Объект.Статус= Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено;
	Объект.ХозяйственнаяОперация= Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
	Объект.СпособДоставки= Перечисления.СпособыДоставки.Самовывоз;
	Объект.ВалютаВзаиморасчетов= Объект.Соглашение.Валюта;
	Справочники.ДоговорыКонтрагентов.УдалитьПорядокОплаты(Объект, Объект.Соглашение);
	Объект.ВариантОформленияПродажи= Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
	Объект.ДатаРаспоряжения= ДокОснование.Дата;
	Объект.НалогообложениеНДС= АльтерраОбщегоНазначения.ПолучитьНалогообложениеНДС(Объект.Организация);
	Объект.БанковскийСчетОрганизации= АльтерраОбщегоНазначения.ПолучитьБанковскийСчетПоУмолчанию(Объект.Организация, Объект.Валюта);
	Объект.ВариантОформленияПродажи= Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
	
	Объект.ЗаполнитьЭтапыГрафикаОплаты();
	
	Для Каждого ТоварОснования Из ДокОснование.Товары Цикл
		НоваяСтрока= Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = ТоварОснования.УслугаАренды;
		НоваяСтрока.Склад = Объект.Склад;
		НоваяСтрока.Упаковка = ТоварОснования.УслугаАренды.ЕдиницаИзмерения;
		НоваяСтрока.Количество = ТоварОснования.КоличествоУслуги;
		НоваяСтрока.КоличествоУпаковок = ТоварОснования.КоличествоУслуги;
		НоваяСтрока.Цена = ТоварОснования.ЦенаУслуги;
		НоваяСтрока.ВидЦены = ТоварОснования.ВидЦены;
		НоваяСтрока.Сумма = ТоварОснования.СуммаУслуги;
		НоваяСтрока.СтавкаНДС = ПреобразоватьНДС(ТоварОснования.СтавкаНДС);
		НоваяСтрока.СуммаНДС = ТоварОснования.СуммаНДСУслуги;
		НоваяСтрока.СуммаСНДС = ТоварОснования.СуммаСНДСУслуги;
	КонецЦикла; 
	
КонецПроцедуры

Процедура ЗаполнитьДокументЧекККМПоОснованию(Объект, ДанныеЗаполнения) Экспорт
	
	ДокОснование = ДанныеЗаполнения;
	ДанныеЗаполнения = Новый Структура;
	
	ЗаполнитьЗначенияСвойств(Объект, ДокОснование,,"Номер,Дата,Автор");
	
	Объект.Дата = ТекущаяДата();
    Объект.ДокументОснование = ДокОснование.Ссылка;
	Объект.Статус = Перечисления.СтатусыЧековККМ.ОтложенСРезервированием;
	Объект.Автор = Пользователи.ТекущийПользователь();
	Объект.Менеджер = Объект.Автор;
	Объект.ОтложенДо = КонецДня(ТекущаяДата());
	Объект.ВидЦены = Объект.Соглашение.ВидЦен;
	//Отменить заполнение реквизита Контрагент при создании документа Чек ККМ
	//на основании документа Возврат аренды номенклатуры
	Объект.Контрагент = ПустаяСсылка();
	
	
	Если РольДоступна("Полныеправа") ИЛИ РольДоступна("ОтметкаКассы") Тогда
		Объект.КассаККМ = Справочники.КассыККМ.КассаККМФискальныйРегистраторДляРМК();
	Иначе
		Объект.КассаККМ = АльтерраОбщегоНазначения.КассаККМПоумолчанию(ДокОснование.Подразделение);
	КонецЕсли;

	СтруктураСостояниеКассовойСмены = РозничныеПродажи.ПолучитьСостояниеКассовойСмены(Объект.КассаККМ);
	Если Объект.Статус <> Перечисления.СтатусыЧековККМ.Пробит
		И Объект.КассоваяСмена <> СтруктураСостояниеКассовойСмены.КассоваяСмена Тогда
		Объект.КассоваяСмена = СтруктураСостояниеКассовойСмены.КассоваяСмена;
	КонецЕсли;
	
	Для Каждого ТоварОснования Из ДокОснование.Товары Цикл
		НоваяСтрока= Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = ТоварОснования.УслугаАренды;
		НоваяСтрока.Склад = Объект.Склад;
		НоваяСтрока.Упаковка = ТоварОснования.УслугаАренды.ЕдиницаИзмерения;
		НоваяСтрока.Количество = ТоварОснования.КоличествоУслуги;
		НоваяСтрока.КоличествоУпаковок = ТоварОснования.КоличествоУслуги;
		НоваяСтрока.Цена = ТоварОснования.ЦенаУслуги;
		НоваяСтрока.ВидЦены = ТоварОснования.ВидЦены;
		НоваяСтрока.Сумма = ТоварОснования.СуммаУслуги; 
		НоваяСтрока.СтавкаНДС = ПреобразоватьНДС(ТоварОснования.СтавкаНДС);	
		НоваяСтрока.СуммаНДС = ТоварОснования.СуммаНДСУслуги;
		НоваяСтрока.СуммаСНДС = ТоварОснования.СуммаСНДСУслуги;
		НоваяСтрока.Продавец = Объект.Менеджер;
	КонецЦикла; 
	
КонецПроцедуры

Функция ПреобразоватьНДС(СтавкаНДС) 
	Если ЗначениеЗаполнено(СтавкаНДС) Тогда
		СтавкаИзСправочника = Справочники.СтавкиНДС.НайтиПоНаименованию(СтавкаНДС);
		Если ЗначениеЗаполнено(СтавкаИзСправочника) Тогда
			Возврат СтавкаИзСправочника;
		Иначе
			Возврат Неопределено;
		КонецЕсли;	
	КонецЕсли;
КонецФункции	

#КонецОбласти 


#Область Печать
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры
#КонецОбласти 


#Область Экспортные
Функция ПолучитьТоварДляВозврата(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АрендаНоменклатурыОстатки.Номенклатура КАК Номенклатура,
	|	АрендаНоменклатурыОстатки.Характеристика КАК Характеристика,
	|	АрендаНоменклатурыОстатки.ВАрендеОстаток КАК ВАрендеОстаток
	|ПОМЕСТИТЬ ВТ_ОстатокАренды
	|ИЗ
	|	РегистрНакопления.АрендаНоменклатуры.Остатки КАК АрендаНоменклатурыОстатки
	|ГДЕ
	|	АрендаНоменклатурыОстатки.ДокументАренды = &Аренда
	|	И АрендаНоменклатурыОстатки.ВАрендеОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АрендаНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	АрендаНоменклатурыТовары.Характеристика КАК Характеристика,
	|	АрендаНоменклатурыТовары.УслугаАренды КАК УслугаАренды,
	|	АрендаНоменклатурыТовары.Цена КАК Цена,
	|	АрендаНоменклатурыТовары.Сумма КАК Сумма,
	|	АрендаНоменклатурыТовары.СтавкаНДС КАК СтавкаНДС,
	|	АрендаНоменклатурыТовары.СуммаНДС КАК СуммаНДС,
	|	АрендаНоменклатурыТовары.СуммаСНДС КАК СуммаСНДС,
	|	АрендаНоменклатурыТовары.ЦенаУслуги КАК ЦенаУслуги,
	|	АрендаНоменклатурыТовары.СуммаУслуги КАК СуммаУслуги,
	|	АрендаНоменклатурыТовары.СуммаНДСУслуги КАК СуммаНДСУслуги,
	|	АрендаНоменклатурыТовары.СуммаСНДСУслуги КАК СуммаСНДСУслуги,
	|	АрендаНоменклатурыТовары.СуммаЗалога КАК СуммаЗалога,
	|	АрендаНоменклатурыТовары.Период КАК Период,
	|	АрендаНоменклатурыТовары.ДатаВозврата КАК ДатаВозврата,
	|	ВТ_ОстатокАренды.ВАрендеОстаток КАК Количество,
	|	ВТ_ОстатокАренды.ВАрендеОстаток КАК КоличествоУслуги,
	|	&ДатаСдачиВАренду КАК ДатаСдачиВАренду
	|ИЗ
	|	ВТ_ОстатокАренды КАК ВТ_ОстатокАренды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АрендаНоменклатуры.Товары КАК АрендаНоменклатурыТовары
	|		ПО (АрендаНоменклатурыТовары.Номенклатура = ВТ_ОстатокАренды.Номенклатура)
	|			И (АрендаНоменклатурыТовары.Характеристика = ВТ_ОстатокАренды.Характеристика)
	|ГДЕ
	|	АрендаНоменклатурыТовары.Ссылка = &Аренда";

	Запрос.УстановитьПараметр("Аренда", Объект.Основание);
	Запрос.УстановитьПараметр("ДатаСдачиВАренду", Объект.ДатаСдачиВАренду);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ = РезультатЗапроса.Выгрузить();

	Возврат ТЗ;
	
КонецФункции


#КонецОбласти
#КонецЕсли
